Tekla.Structures.AnalysisInternal.DotAnalysisMaterial
Serialization structure for ModelAnalysisProperties.

Tekla.Structures.AnalysisInternal.DotAnalysisMaterial._AnalysisObject
Analyis object.

Tekla.Structures.AnalysisInternal.DotAnalysisMaterial._Name
Name.

Tekla.Structures.AnalysisInternal.DotAnalysisMaterial._Type
The type of the material.

Tekla.Structures.AnalysisInternal.DotAnalysisMaterial._DampingFactor
The damping factor of the material.

Tekla.Structures.AnalysisInternal.DotAnalysisMaterial._Density
The density of the material.

Tekla.Structures.AnalysisInternal.DotAnalysisMaterial._ModulusOfElasticity
Modulus of elasticity.

Tekla.Structures.AnalysisInternal.DotAnalysisMaterial._PoissonsRatio
Poissons ratio.

Tekla.Structures.AnalysisInternal.DotAnalysisMaterial._ThermalDilatation
Thermal dilatation.

Tekla.Structures.AnalysisInternal.DotAnalysisMaterial.ToStruct(Tekla.Structures.Analysis.AnalysisMaterial)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisMaterial.FromStruct(Tekla.Structures.Analysis.AnalysisMaterial)
DO NOT USE! For internal usage only!
P: P.